## 🐳 Docker-квест: найдите секретное слово

### Цель

Научиться работать с образами и контейнерами в Docker: скачивать, запускать, исследовать, получать информацию и удалять.

---

### Задание

1. **Скачайте мой образ с Docker Hub**
2. **Посмотрите список образов**
   Убедитесь, что образ появился локально.
3. **Запустите контейнер из этого образа**
4. **Найдите секретное слово внутри контейнера**
   * Найдите файл `secret.txt` и откройте его (`cat secret.txt`).
   * Напишите мне в ЛС кодовое слово.
5. **Посмотрите информацию о контейнере**
   * Какую команду запускает контейнер?
   * Какой у него IP-адрес?
6. **Остановите и удалите контейнер и образ**

---

### Что нужно сдать:

* Секретное слово.
* Ответы на вопросы:

  1. Какая команда запускается у контейнера по умолчанию?
  2. Какой IP-адрес у контейнера?
